{
    "news": [
        {
            "id": 1,
            "newsName": "AUDUSD hits resistance at 0.6475 and consolidates above 0.6425",
            "fromUser": "Lewis",
            "content": "The aussie is going through an extraordinary recovery on Friday, rallying about 2.5% on the day amid a favorable market sentiment, to regain most of the previous six days' losses. The pair bounced up at 0.6280 area earlier on Friday to reach highs at 0.6475 during the midday US trading session, before consolidating above 0.6425. US employment figures have shown mixed readings in October, which has increased the weakness of an already vulnerable US dollar as risk appetite returned to the markets.",
            "date": "05/10/2022",
            "source": {
                "url": "https://milliyfx.reservio.com/",
                "sourceName": "placeholder"
            },
            "comments": [
                {
                    "id": 16,
                    "user": "Zukha",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                },
                {
                    "id": 17,
                    "user": "Ziyo",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                }
            ]
        },
        {
            "id": 2,
            "newsName": "AUDUSD hits resistance",
            "fromUser": "Raha",
            "content": "The aussie is going through an extraordinary recovery on Friday, rallying about 2.5% on the day amid a favorable market sentiment, to regain most of the previous six days' losses. The pair have shown mixed readings in October, which has increased the weakness of an already vulnerable US dollar as risk appetite returned to the markets.",
            "date": "05/10/2022",
            "source": {
                "url": "https://milliyfx.reservio.com/",
                "sourceName": "placeholder"
            },
            "comments": [
                {
                    "id": 16,
                    "user": "Zukha",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                },
                {
                    "id": 17,
                    "user": "Ziyo",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                },
                {
                    "id": 18,
                    "user": "Angelina",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                },
                {
                    "id": 19,
                    "user": "Javlon",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                }
            ]
        }
    ],
    "analysis": [
        {
            "id": 3,
            "name": "AUDUSD",
            "fromUser": "Raha",
            "content": "Did the Japanese Ministry of Finance intervene? A sharp drop of 120 points almost instantly from the 1998 high of 147.670, the price has since returned higher. This may very well be a technical reaction to the level, but the speed at which it happens seems odd. We will undoubtedly hear from the Bank of Japan and the Treasury this evening.",
            "date": "04/10/2022",
            "image": "placeholder",
            "comments": [
                {
                    "id": 16,
                    "user": "Zukha",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                }
            ]
        },
        {
            "id": 4,
            "name": "GBPUSD",
            "fromUser": "Raha",
            "content": "Did thened higher. This may very well be a technical reaction to the level, but the speed at which it happens seems odd. We will undoubtedly hear from the Bank of Japan and the Treasury this evening.",
            "date": "04/10/2022",
            "image": "placeholder",
            "comments": [
                {
                    "id": 16,
                    "user": "Zukha",
                    "date": "22/02/2022",
                    "comment": "Great news!"
                }
            ]
        }
    ]
}